file-icons.file-icons
jeff-hykin.better-shellscript-syntax
maximilionus.dark-shell
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode-remote.remote-containers
PKief.material-icon-theme
AmazonWebServices.aws-toolkit-vscode