
# Taps
tap 'caskroom/homebrew-cask'
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "hashicorp/terraform"
tap "homebrew/cask-fonts"
tap 'aws/tap'


# Languages
brew "rbenv"
brew "python@3.8"
brew "node"
brew "go"

# Tools
brew "awscli"
brew 'aws-sam-cli'
brew "azure-cli"
brew 'git'
brew "yarn"
brew "gnupg"
brew "terraform"
brew "make"
brew "pre-commit"
brew "jq"

# Shell
brew "starship"
brew 'zsh-syntax-highlighting'
brew "zsh-autosuggestions"
brew "diff-so-fancy"
brew 'tree'
brew "vim"

# Casks
cask "visual-studio-code"
cask 'virtualbox'
cask 'iterm2'
cask "docker"
cask 'slack'


# Fonts
cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-menlo-for-powerline"

