tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap 'aws/tap'
tap 'flux'

# Langs
brew "pyenv"
brew "go"
brew "nvm"
brew "terraform"
brew "lua"

# Shell
brew "vim"
brew "tmux"
brew "starship"
brew 'zsh-syntax-highlighting'
brew "zsh-autosuggestions"
brew "diff-so-fancy"
brew "htop"


# Kubernetes
brew "kubernetes-cli"
brew "minikube"
brew "kind"
brew "helm"
brew "k9s"
brew "fluxcd"
brew "kustomize"
brew "kubeseal"
brew "k3d"
brew "kubeval"

# DB's
brew "redis"
brew "sqlite"

# Utils
brew "httpie"
brew "websocat"
brew "pre-commit"
brew "watch"
brew "direnv"
brew "jq"
brew "gpg"
brew "sops"

# Fonts
brew "font-hack-nerd-font"

# Security
brew "nmap"
brew "telnet"


cask "visual-studio-code"
cask "slack"
